package com.baway.jingzeyang.bean;

import java.util.List;

/**
 * Created by 荆泽阳 on 2017/3/22.
 * .::::.
 * .::::::::.
 * :::::::::::  Goddess bless, never bug
 * ..:::::::::::'
 * '::::::::::::'
 * .::::::::::
 * '::::::::::::::..
 * ..::::::::::::.
 * ``::::::::::::::::
 * ::::``:::::::::'        .:::.
 * ::::'   ':::::'       .::::::::.
 * .::::'      ::::     .:::::::'::::.
 * .:::'       :::::  .:::::::::' ':::::.
 * .::'        :::::.:::::::::'      ':::::.
 * .::'         ::::::::::::::'         ``::::.
 * ...:::           ::::::::::::'              ``::.
 * ```` ':.          ':::::::::'                  ::::..
 * '.:::::'                    ':'````..
 */

public class DataBean {

    /**
     * reason : success
     * result : [{"day":"2/5","date":"249年02月05日","title":"高平陵之变","e_id":"1636"},{"day":"2/5","date":"1500年02月05日","title":"意大利从法国人手里收复了米兰","e_id":"1637"},{"day":"2/5","date":"1649年02月05日","title":"苏格兰人宣告查理二世为爱丁堡国王","e_id":"1638"},{"day":"2/5","date":"1661年02月05日","title":"清世祖（即顺治帝）爱新觉罗·福临逝世","e_id":"1639"},{"day":"2/5","date":"1722年02月05日","title":"俄皇彼得一世宣布废除长子继承皇位制度","e_id":"1640"},{"day":"2/5","date":"1799年02月05日","title":"英国植物学家林德利出生","e_id":"1641"},{"day":"2/5","date":"1840年02月05日","title":"新西兰的毛利人酋长通过《怀唐伊条约》向英国交出主权","e_id":"1642"},{"day":"2/5","date":"1885年02月05日","title":"刚果\u201c自由邦\u201d建立，成为比利时国王利奥波德二世的私人财产","e_id":"1643"},{"day":"2/5","date":"1900年02月05日","title":"摩根组建资产为10亿美元的钢铁公司","e_id":"1644"},{"day":"2/5","date":"1901年02月05日","title":"摩根购并钢铁公司成为钢铁巨头","e_id":"1645"},{"day":"2/5","date":"1907年02月05日","title":"经学大师俞樾逝世","e_id":"1646"},{"day":"2/5","date":"1912年02月05日","title":"民国政府第一银行\u2014\u2014中国银行开业","e_id":"1647"},{"day":"2/5","date":"1912年02月05日","title":"中国现代文学家何其芳诞辰","e_id":"1648"},{"day":"2/5","date":"1919年02月05日","title":"\u201c黄色国际\u201d建立","e_id":"1649"},{"day":"2/5","date":"1922年02月05日","title":"畅销世界的美国杂志《读者文摘》创刊","e_id":"1650"},{"day":"2/5","date":"1929年02月05日","title":"国民党政府将奉天省改名为辽宁省","e_id":"1651"},{"day":"2/5","date":"1940年02月05日","title":"十四世达赖喇嘛坐床","e_id":"1652"},{"day":"2/5","date":"1949年02月05日","title":"毛泽东发表惩办战犯声明","e_id":"1653"},{"day":"2/5","date":"1949年02月05日","title":"中共中央指示私营工厂复工","e_id":"1654"},{"day":"2/5","date":"1952年02月05日","title":"中国决定参加第15届奥运会","e_id":"1655"},{"day":"2/5","date":"1957年02月05日","title":"中国第一次公演西方歌剧《茶花女》","e_id":"1656"},{"day":"2/5","date":"1964年02月05日","title":"中国第一例自体骨髓移植手术获成功","e_id":"1657"},{"day":"2/5","date":"1964年02月05日","title":"中共中央号召工业学大庆农业学大寨","e_id":"1658"},{"day":"2/5","date":"1967年02月05日","title":"上海人民公社成立","e_id":"1659"},{"day":"2/5","date":"1970年02月05日","title":"中共中央指示要求反对贪污盗窃、投机倒把","e_id":"1660"},{"day":"2/5","date":"1971年02月05日","title":"美国\u201c阿波罗14\u201d号宇航员登月球","e_id":"1661"},{"day":"2/5","date":"1974年02月05日","title":"苏联国际象棋大师斯巴斯基创造的奇迹","e_id":"1662"},{"day":"2/5","date":"1983年02月05日","title":"纳粹战犯\u201c里昂屠夫\u201d巴比被引渡归案","e_id":"1663"},{"day":"2/5","date":"1984年02月05日","title":"解放军\u201c第一大将\u201d粟裕逝世","e_id":"1664"},{"day":"2/5","date":"1985年02月05日","title":"直布罗陀陆地边界关闭16年后重新开放","e_id":"1665"},{"day":"2/5","date":"1985年02月05日","title":"40国裁军会议1985年春季会议在日内瓦开幕","e_id":"1666"},{"day":"2/5","date":"1988年02月05日","title":"苏共中央为布哈林平反昭雪","e_id":"1667"},{"day":"2/5","date":"1994年02月05日","title":"新中国现代纺织工业的主要奠基人钱之光逝世","e_id":"1668"},{"day":"2/5","date":"1994年02月05日","title":"中国第一座核电站投入商业运行","e_id":"1669"},{"day":"2/5","date":"1994年02月05日","title":"萨拉热窝市内遭炮击，68人死亡，约200人受伤","e_id":"1670"},{"day":"2/5","date":"1994年02月05日","title":"江泽民高度赞扬徐洪刚不畏强暴","e_id":"1671"},{"day":"2/5","date":"1997年02月05日","title":"瑞士三大银行设立人道主义犹太人补偿基金","e_id":"1672"},{"day":"2/5","date":"1998年02月05日","title":"国务院召开第六次反腐败工作会议","e_id":"1673"},{"day":"2/5","date":"2008年02月05日","title":"\u201c感动中国2007年度十大人物\u201d揭晓","e_id":"1674"},{"day":"2/5","date":"2009年02月05日","title":"\u201c感动中国2008年度十大人物\u201d揭晓","e_id":"1675"}]
     * error_code : 0
     */

    public String reason;
    public int error_code;
    public List<ResultBean> result;


    @Override
    public String toString() {
        return "DataBean{" +
                "reason='" + reason + '\'' +
                ", error_code=" + error_code +
                ", result=" + result +
                '}';
    }

    public static class ResultBean {
        /**
         * day : 2/5
         * date : 249年02月05日
         * title : 高平陵之变
         * e_id : 1636
         */

        public String day;
        public String date;
        public String title;
        public String e_id;


        @Override
        public String toString() {
            return "ResultBean{" +
                    "day='" + day + '\'' +
                    ", date='" + date + '\'' +
                    ", title='" + title + '\'' +
                    ", e_id='" + e_id + '\'' +
                    '}';
        }
    }
}
